from url import *
global pythonTXT
global robloxTXT
global designTXT
global interfaceTXT
global courseslistMessage

courseslistMessage = f'''Сейчас в нашей школе 4 курса:

Разработка игр Roblox Studio /roblox
Программирование Python /coding
Графический дизайн Adobe /design
UX/UI дизайн Figma /interface

Если не определились с выбором, то совместно с психологом мы разработали {url_forms}, которая поможет определить наиболее подходящую специальность'''

pythonTXT = '''Курс ведет Даша /dasha
  
Что будем изучать?
🔸Разберем типы данных - какие они бывают и как работают
🔸Освоим вывод/ввод текста на экране, научимся работать со специальными символами
🔸Изучим логические операторы - что это такое и как ими пользоваться в коде
🔸Напишем нашу первую игру, ведь чтобы начать программировать вовсе не нужно зубрить материалы несколько лет

Почему это полезно?
🔸Развитие критического мышления - рассуждение как будет работать программа, проанализировать слабые и сложные места кода и исправить их (то, что в мире программистов называется рефакторинг), написать код и исправить ошибки, проверить его на работоспособность и оценить результат
🔸Развитие логического мышления - каждый раз, когда мы пишем код, это вызов нашему интеллекту. Приходится решать множество мелких логических задач, чтобы понять, как сделать так, чтобы программа работала корректно
🔸Развитие терпения и усидчивости - процесс написания кода может запросто занимать нескольких дней, а при первой проверке выдавать ошибки, на устранение которых также потребуется время, но результат того стоит!

Кем можно стать?
🔶Программист - занимается разработкой алгоритмов и пишет код компьютерных программ. Для того, чтобы освоить эту профессию достаточно базовых знаний о программировании
🔸Разработчик - прорабатывает исходный код софта и его архитектуру, рассматривая всю систему целиком. Его работа отличается от программиста более широкими знаниями и опытом работы, а ещё уровнем взаимодействия с дизайнерами другими программистами

Почему Python?
🔸Python - один из самых востребованных языков на сегодняшний день. К примеру, TikTok написан именно на нем. Знания этого языка актуальны и востребованы, а простой и удобный синтаксис делают его легким для изучения даже детьми'''

robloxTXT = '''Курс ведёт Даша /dasha
  
Что будем изучать?
🔹Познакомимся с этапами создания игр, разберемся в жанрах
🔹Научимся работать в 3д-мире, генерировать ландшафты, создавать объекты, работать с текстурами
🔹Научимся писать скрипты. Разберёмся, зачем они нужны и как их писать грамотно
🔹Больше практики! В рамках курса мы создадим несколько игр в разных жанрах

Почему это полезно?
🔹Решение логических задач, пусть и в игровой форме, здорово развивает мышление
🔹Даже самые простые на первый взгляд игры в движение приводит код. На курсе мы познакомится с основами программирования
🔹О чем будет игра? в каком мире? какие герои будут в игре? как в нее играть? Границ в создании мира нет, всё зависит лишь от воображения, и оно будет развиваться с каждой новой игрой
🔹Представьте сюжет - найти красный дом в городском лабиринте. Звучит нехитро, но теперь это надо построить. Схему лабиринта, сотни разных домиков, улицы... Это требует терпения и усидчивости, тут без них никуда. Зато в итоге можно представить миру собственную крутую игру! (и даже включить монетизацию, но не будем раскрывать все секреты сразу)
🔹И, конечно, как и с любой новой информацией, ребенок расширит свой кругозор. Есть о чем поболтать в школьной компании!

Кем можно стать?
В курсе ребенок сможет примерить на себя несколько профессий из перспективной сферы геймдева:
🔹Идея игры, сюжет, пространство мира, характер персонажей и их внешний вид - это сфера геймдизайнера
🔹Чтобы игра функционировала, необходимо написать код, за который отвечает программист
🔹Модели, карта, текстуры - за это и многое другое создает 3д-дизайнер
🔹Чтобы к моменту выхода игра работала идеально, поиском багов и глюков занимается тестировщик

Почему Roblox Studio?
Сегодня это одна из самых популярных международных игровых платформ. Работа в Roblox Studio подходит и детям за счет простого интерфейса, удобства написания скрипта и яркости пресетов. Число крупных компаний-разработчиков игр на базе Roblox Studio по всему миру неуклонно растет, что делает его востребованным инструментом для работы'''

designTXT = '''Курс ведёт Рома /roma

Что будем изучать?
🔴Разберемся в цветах и научимся создавать их удачные сочетания
🔴Поймем, как выстраивать композицию
🔴Научимся грамотно сочетать иллюстрации с текстом
🔴Поймем, когда использовать растровую графику, а когда векторную
🔴Разберемся, как подбирать шрифтовые пары и как правильно сверстать текст
🔴Изучим фирменный стиль и сделаем первый логотип
🔴Научимся разговаривать с типографией на одном языке
🔴Узнаем, как делать коммерческий дизайн: как попасть в целевую аудиторию и как дизайн направляет людей на какие-то действия

Почему это полезно?
🔴Развитие эмоционального интеллекта, ведь в дизайне главное - заинтересовать
🔴Развитие кругозора. Чтобы развиваться и с каждым разом делать дизайн лучше, важна «насмотренность» - уметь разобраться, как делают другие авторы и вдохновляться окружающим миром
🔴Научиться экспереминтировать. Хороший дизайн - это не всегда строгое следование правилам. Знание правил позволяет нарушать их так, чтобы дизайн выглядел современно и ярко
🔴Навыки, которые пригодятся в повседневной жизни - отредактировать фотографию, сделать аватарку для соцсетей, постер с любимыми кумирами или презентацию для своего доклада

Кем можно стать?
🔴Графический дизайнер - эта профессия включает в себя множество направлений и позволяет позже определиться с более узкой специализацией (или остаться мастером на все руки): разработчик фирменного стиля, дизайнер упаковки, наружной рекламы, веб-дизайнер, дизайнер-верстальщик каталогов и книг, оформитель мероприятий, дизайнер навигации и многие другие направления. В современном мире практически в любом проекте не обойтись без графического дизайнера

Почему Adobe?
🔴Несмотря на то, что главные инструменты Adobe были созданы при динозаврах, этот пакет продолжает оставаться стандартом в отрасли графического дизайна и сопутствующих профессиях (веб, видеомонтаж и др.). Программы Adobe достаточно сложные для новичка, но имеют похожие интерфейсы, поэтому навык работы даже в одной из них позволит в будущем сэкономить время и силы для творчества'''

interfaceTXT = '''Курс ведёт Рома /roma

UX/UI дизайнер работает над созданием интерфейсов приложений, сайтов, игр и других продуктов, где есть интерфейс, а он сейчас есть почти везде. Банкомат, фотоаппарат и даже стиральная машина общаются с человеком именно через интерфейс

Что будем изучать? 
🟣Научимся работать с фигурами, фреймами и шрифтами
🟣Изучим типы сайтов и их механику, научимся оптимизировать дизайн под разные устройства и делать «резиновые» интерфейсы
🟣Соберем элементы в компоненты и создадим свою первую дизайн-библиотеку
🟣Научимся юзер-френдли: узнаем, как сделать современный и удобный для пользователя дизайн
🟣 Разберемся, как анимировать элементы, чтобы интерфейс был динамичным 

Почему это полезно?
🟣Развитие эмоционального интеллекта. В дизайне интерфейсов главное - делать функции удобными и понятными для пользователя
🟣Развитие кругозора. Чтобы развиваться и с каждым разом делать лучше, важна «насмотренность». Кто и как делает, какой дизайн вдохновляет
🟣Навыки, которые пригодятся в повседневной жизни - например, сделать увлекательную презентацию для школы или нарисовать схему для доклада.

Кем может стать?
🟣UX-дизайнер - проектирует интерфейс, его логику, последовательность действий, и формирует задачи для иллюстраторов, программистов и UI-дизайнеров

🟣UI-дизайнер - создает из проекта настоящий интерфейс, рисует кнопки и окна, делает простую анимацию

Почему Figma?adobe
Figma - простой, удобный и понятный инструмент, которому способен обучиться даже ребёнок. В последние годы стал стандартом отрасли проектирования интерфейсов, оттеснив продукты Adobe и Sketch'''